#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra/ecr relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/ory-example/ory-example/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/ory-example/ory-example

To view this run in a browser, visit:
https://app.terraform.io/app/ory-dev/ecr/runs/run-tFepptY4LjFaRv8v

Waiting for the plan to start...

Terraform v1.4.1
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.database_migrator will be created
  + resource "aws_ecr_repository" "database_migrator" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "ory-dev-database-migrator"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "ecr"
        }
    }

  # aws_ecr_repository.database_provisioner will be created
  + resource "aws_ecr_repository" "database_provisioner" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "ory-dev-database-provisioner"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "ecr"
        }
    }

  # aws_ecr_repository.hydra will be created
  + resource "aws_ecr_repository" "hydra" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "ory-dev-hydra"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "ecr"
        }
    }

  # aws_ecr_repository.keto will be created
  + resource "aws_ecr_repository" "keto" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "ory-dev-keto"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "ecr"
        }
    }

  # aws_ecr_repository.kratos will be created
  + resource "aws_ecr_repository" "kratos" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "ory-dev-kratos"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "ecr"
        }
    }

  # aws_ecr_repository.oathkeeper will be created
  + resource "aws_ecr_repository" "oathkeeper" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "ory-dev-oathkeeper"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "ecr"
        }
    }

  # aws_ssm_parameter.repositories will be created
  + resource "aws_ssm_parameter" "repositories" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ory/dev/ecr/repositories"
      + tags_all       = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "ecr"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + repository_uris = {}

```

</details>

*Pushed by: @keenan-v1, Action: `pull_request`*